package com.company;

import Lab2.Lab2A;
import Lab2.Lab2C;

public class Main {

    public static void main(String[] args) {

//Ввести с консоли n целых чисел. На консоль вывести: 10. Числа в порядке убывания частоты встречаемости чисел.
    	Integer[] array = new Integer[] {1, 2, 1, 2, 2, 3, 5};
		Lab1 aba = new Lab1(array);
		aba.doTheTask();


/*
        В приведенных ниже заданиях необходимо вывести внизу фамилию разработчика, дату и время получения задания, а также дату и время сдачи задания.
        Добавить комментарии в программы в виде ' комментарий ', сгенерировать
        html-файл документации. В заданиях на числа объект можно создавать в виде
        массива символов.
 */

    //2. Упорядочить и вывести числа в порядке возрастания (убывания) значений их длины.
	//Lab2A lab2a = new Lab2A();
	//lab2a.doTheTask();

        //10. Найти максимальный элемент (ы) в матрице и удалить из матрицы все строки и столбцы, его содержащие.
     // Lab2C lab2c = new Lab2C();
     // lab2c.doTheTask();
    }
}
